<?php
require dirname(__DIR__) . '/vendor/autoload.php';

use classes\RangeArray;

/*
 * task:
На вход коду поступает массив, где каждый его элемент является 2хэлементным массивом (диапозоном):

[[1,2], [4,5], [8,12], [6,7], [13,20], [2,7]].

Необходимо "схлопнуть" входные данные по следующему алгоритму:
Если два диапозона "пересекаются" (даже на одном числе) на числовой прямой, то они схлопываются.
Для примера, [1,2] и [2,7] после схлопывания становятся диапозоном [1,7];
[1,5] и [3,7] становятся [1,7];
[1,7] и [3,4] становятся [1,7];
[1,2] и [4,7] так и остаются двумя диапозонами так как не пересекаются.
Задача считается выполненой, если после отработки алгоритма в массиве нет диапозонов которые можно схлопнуть.
Для примера, результатом обработки приведенных входных данных будет массив:
[[1,7], [8,12],[13,20]].


[[1,2], [4,5], [8,12], [6,7], [13,20], [2,7]].
[[1,7], [8,12],[13,20]].
 */
$tests = [
    [
        't' => [[1,2], [2,7]], //right
        'r' => [[1,7]],
    ],
    [
        't' => [[1,5], [3,7]], //right
        'r' => [[1,7]],
    ],
    [
        't' => [[1,7], [3,4]], //have
        'r' => [[1,7]],
    ],
    [
        't' => [[1,2], [4,7]], //not collapse
        'r' => [[1,2], [4,7]],
    ],
    [
        't' => [[1,2], [4,5], [8,12], [6,7], [13,20], [2,7]], //retries
        'r' => [[1,7], [8,12],[13,20]]
    ],
    [
        't' => [[3,4], [1,7]], //include
        'r' => [[1,7]],
    ],
    [
        't' => [[1,3], [3,5], [5, 7]],
        'r' => [[1,7]],
    ],
    [
        't' => [[1,7], [3,7]],
        'r' => [[1,7]],
    ],
    [
        't' => [[-2,0], [-1,7]], //negative
        'r' => [[-2,7]],
    ],
];

foreach ($tests as $key => $test) {
    $rangeArray = new RangeArray($test['t']);
    $result = $rangeArray->collapse();
    if (count(array_diff($result, $test['r'])) === 0) {
        print_r("{$key} success \n");
//        print_r($result);
//        print_r($test['r']);
    } else {
        print_r($result);
    }
}
